In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('data/gapminder.tsv', sep='\t')

In [3]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [4]:
avg_life_by_year = df.groupby('year').lifeExp.mean()

In [5]:
avg_life_by_year

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [6]:
years = df.year.unique()

In [7]:
years

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [8]:
y1957 = df.loc[df.year == 1957, :]

In [10]:
y1957_mean = y1957.lifeExp.mean()
y1957_mean

51.50740112676054

In [11]:
g = df.groupby('year')

In [18]:
def my_mean(values):
    n = len(values)
    sum = 0
    for value in values:
        sum = sum + value # sum += values
    return sum /n

In [19]:
agg_my_mean = df.groupby('year').lifeExp.agg(my_mean)

In [20]:
agg_my_mean

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [21]:
def my_mean_diff(values, diff_value):
    n = len(values)
    sum = 0
    for value in values:
        sum = sum + value
    mean = sum/n
    return mean-diff_value

In [22]:
total_mean = df.lifeExp.mean()

In [25]:
agg_mean_diff = df.groupby('year').lifeExp.agg(my_mean_diff, diff_value=total_mean)

In [26]:
agg_mean_diff

year
1952   -10.416820
1957    -7.967038
1962    -5.865190
1967    -3.796150
1972    -1.827053
1977     0.095718
1982     2.058758
1987     3.738173
1992     4.685899
1997     5.540237
2002     6.220483
2007     7.532983
Name: lifeExp, dtype: float64

In [1]:
import numpy as np

In [5]:
gdf = df.groupby('year').lifeExp.agg([np.count_nonzero, np.mean, np.std])

In [6]:
gdf

      count_nonzero       mean        std
year
1952          142.0  49.057620  12.225956
1957          142.0  51.507401  12.231286
1962          142.0  53.609249  12.097245
1967          142.0  55.678290  11.718858
1972          142.0  57.647386  11.381953
1977          142.0  59.570157  11.227229
1982          142.0  61.533197  10.770618
1987          142.0  63.212613  10.556285
1992          142.0  64.160338  11.227380
1997          142.0  65.014676  11.559439
2002          142.0  65.694923  12.279823
2007          142.0  67.007423  12.073021

In [33]:
gdf_dict = df.groupby('year').agg({'lifeExp':'mean', 'pop':'median'
                                   , 'gdpPercap':'median'})

In [34]:
gdf_dict

        lifeExp         pop    gdpPercap
year
1952  49.057620   3943953.0  1968.528344
1957  51.507401   4282942.0  2173.220291
1962  53.609249   4686039.5  2335.439533
1967  55.678290   5170175.5  2678.334741
1972  57.647386   5877996.5  3339.129407
1977  59.570157   6404036.5  3798.609244
1982  61.533197   7007320.0  4216.228428
1987  63.212613   7774861.5  4280.300366
1992  64.160338   8688686.5  4386.085502
1997  65.014676   9735063.5  4781.825478
2002  65.694923  10372918.5  5319.804524
2007  67.007423  10517531.0  6124.371109

### 표준점수 평균 0 , 1

In [7]:
def my_zscore(x):
    return (x - x.mean())/x.std()

In [8]:
transfrom_z = df.groupby('year').lifeExp.transform(my_zscore)

In [9]:
transfrom_z.shape, df.shape

((1704,), (1704, 6))

In [10]:
df.shape

(1704, 6)

In [6]:
import seaborn as sns

https://github.com/seaborn/seaborn-data

In [7]:
tips = sns.load_dataset('tips')

In [8]:
tips_10 = tips.sample(10)

In [9]:
tips_10

     total_bill   tip     sex smoker   day    time  size
4         24.59  3.61  Female     No   Sun  Dinner     4
190       15.69  1.50    Male    Yes   Sun  Dinner     2
84        15.98  2.03    Male     No  Thur   Lunch     2
20        17.92  4.08    Male     No   Sat  Dinner     2
204       20.53  4.00    Male    Yes  Thur   Lunch     4
143       27.05  5.00  Female     No  Thur   Lunch     6
119       24.08  2.92  Female     No  Thur   Lunch     4
58        11.24  1.76    Male    Yes   Sat  Dinner     2
50        12.54  2.50    Male     No   Sun  Dinner     2
115       17.31  3.50  Female     No   Sun  Dinner     2

In [46]:
tips_10.loc[np.random.permutation(tips_10.index)[:4], 'total_bill'] = np.NaN

In [47]:
tips_10

     total_bill   tip     sex smoker   day    time  size
232       11.61  3.39    Male     No   Sat  Dinner     2
98          NaN  3.00    Male    Yes   Fri  Dinner     2
112       38.07  4.00    Male     No   Sun  Dinner     3
130       19.08  1.50    Male     No  Thur   Lunch     2
188         NaN  3.50  Female    Yes   Sun  Dinner     3
238       35.83  4.67  Female     No   Sat  Dinner     3
59          NaN  6.73    Male     No   Sat  Dinner     4
107         NaN  4.29    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
145        8.35  1.50  Female     No  Thur   Lunch     2

In [48]:
count_gender = tips_10.groupby('sex').count()

In [49]:
count_gender

        total_bill  tip  smoker  day  time  size
sex
Male             4    7       7    7     7     7
Female           2    3       3    3     3     3

In [50]:
def fill_na_mean(x):
    avg= x.mean()
    return x.fillna(avg)

In [51]:
total_bill_group_mean = tips_10.groupby('sex').total_bill.transform(fill_na_mean)

In [52]:
total_bill_group_mean

232    11.610
98     21.645
112    38.070
130    19.080
188    22.090
238    35.830
59     21.645
107    21.645
242    17.820
145     8.350
Name: total_bill, dtype: float64

In [54]:
tips_10['fill_total_bill'] = total_bill_group_mean

In [55]:
tips_10

     total_bill   tip     sex smoker   day    time  size  fill_total_bill
232       11.61  3.39    Male     No   Sat  Dinner     2           11.610
98          NaN  3.00    Male    Yes   Fri  Dinner     2           21.645
112       38.07  4.00    Male     No   Sun  Dinner     3           38.070
130       19.08  1.50    Male     No  Thur   Lunch     2           19.080
188         NaN  3.50  Female    Yes   Sun  Dinner     3           22.090
238       35.83  4.67  Female     No   Sat  Dinner     3           35.830
59          NaN  6.73    Male     No   Sat  Dinner     4           21.645
107         NaN  4.29    Male    Yes   Sat  Dinner     2           21.645
242       17.82  1.75    Male     No   Sat  Dinner     2           17.820
145        8.35  1.50  Female     No  Thur   Lunch     2            8.350

In [56]:
tips.shape

(244, 7)

In [58]:
tips['size'].value_counts()

2    156
3     38
4     37
5      5
6      4
1      4
Name: size, dtype: int64

In [61]:
tips_filterd  = tips.groupby('size').filter(lambda x:x['size'].count() >=30)

In [62]:
tips_filterd.shape

(231, 7)

In [63]:
gender_time= tips.groupby(['sex','time'])

In [68]:
gender_time.mean().reset_index()

      sex    time  total_bill       tip      size
0    Male   Lunch   18.048485  2.882121  2.363636
1    Male  Dinner   21.461452  3.144839  2.701613
2  Female   Lunch   16.339143  2.582857  2.457143
3  Female  Dinner   19.213077  3.002115  2.461538

In [71]:
 tips.groupby(['sex','time'], as_index=False).mean()
    .to_csv('tips_gender_time.csv')

In [73]:
titanic = sns.load_dataset('titanic')

In [74]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [75]:
titanic.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [76]:
titanic.groupby(['sex','class']).survived.mean()

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [77]:
titanic.groupby(['sex','class']).survived.mean().unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [78]:
flights = pd.read_csv('data/flights.csv')

In [79]:
flights.head(2)

,MONTH,DAY,WEEKDAY,AIRLINE,ORG_AIR,DEST_AIR,SCHED_DEP,DEP_DELAY,AIR_TIME,DIST,SCHED_ARR,ARR_DELAY,DIVERTED,CANCELLED
0,1,1,4,WN,LAX,SLC,1625,58.0,94.0,590,1905,65.0,0,0
1,1,1,4,UA,DEN,IAD,823,7.0,154.0,1452,1333,-13.0,0,0

In [81]:
flights.groupby('AIRLINE').ARR_DELAY.agg('mean')

AIRLINE
AA     5.542661
AS    -0.833333
B6     8.692593
DL     0.339691
EV     7.034580
F9    13.630651
HA     4.972973
MQ     6.860591
NK    18.436070
OO     7.593463
UA     7.765755
US     1.681105
VX     5.348884
WN     6.397353
Name: ARR_DELAY, dtype: float64

In [83]:
flights.groupby(['AIRLINE','WEEKDAY']).CANCELLED.agg('mean').head(7)

AIRLINE  WEEKDAY
AA       1          0.032106
         2          0.007341
         3          0.011949
         4          0.015004
         5          0.014151
         6          0.018667
         7          0.021837
Name: CANCELLED, dtype: float64

In [84]:
flights.groupby(['AIRLINE','WEEKDAY']).CANCELLED.agg(['mean','sum']).head(7)

                     mean  sum
AIRLINE WEEKDAY
AA      1        0.032106   41
        2        0.007341    9
        3        0.011949   16
        4        0.015004   20
        5        0.014151   18
        6        0.018667   21
        7        0.021837   29

In [85]:
weight_loss = pd.read_csv('data/weight_loss.csv')

In [86]:
weight_loss.head(2)

  Name Month    Week  Weight
0  Bob   Jan  Week 1     291
1  Amy   Jan  Week 1     197

In [87]:
weight_loss[weight_loss.Month =='Jan']

  Name Month    Week  Weight
0  Bob   Jan  Week 1     291
1  Amy   Jan  Week 1     197
2  Bob   Jan  Week 2     288
3  Amy   Jan  Week 2     189
4  Bob   Jan  Week 3     283
5  Amy   Jan  Week 3     189
6  Bob   Jan  Week 4     283
7  Amy   Jan  Week 4     190

In [89]:
weight_loss.query('Month=="Jan"')

  Name Month    Week  Weight
0  Bob   Jan  Week 1     291
1  Amy   Jan  Week 1     197
2  Bob   Jan  Week 2     288
3  Amy   Jan  Week 2     189
4  Bob   Jan  Week 3     283
5  Amy   Jan  Week 3     189
6  Bob   Jan  Week 4     283
7  Amy   Jan  Week 4     190

In [91]:
weight_loss.Weight.iloc[0]

291

In [92]:
def find_prec_loss(s):
    return (s-s.iloc[0])/s.iloc[0]

In [93]:
per_weight_loss = weight_loss.groupby(['Name']).Weight.transform(find_prec_loss)

In [95]:
per_weight_loss = weight_loss.groupby(['Name','Month']).Weight.transform(find_prec_loss)

In [97]:
per_weight_loss.head()

0    0.000000
1    0.000000
2   -0.010309
3   -0.040609
4   -0.027491
Name: Weight, dtype: float64

In [98]:
weight_loss['per_weight_loss'] = per_weight_loss.round(3)

In [99]:
weight_loss

   Name Month    Week  Weight  per_weight_loss
0   Bob   Jan  Week 1     291            0.000
1   Amy   Jan  Week 1     197            0.000
2   Bob   Jan  Week 2     288           -0.010
3   Amy   Jan  Week 2     189           -0.041
4   Bob   Jan  Week 3     283           -0.027
5   Amy   Jan  Week 3     189           -0.041
6   Bob   Jan  Week 4     283           -0.027
7   Amy   Jan  Week 4     190           -0.036
8   Bob   Feb  Week 1     283            0.000
9   Amy   Feb  Week 1     190            0.000
10  Bob   Feb  Week 2     275           -0.028
11  Amy   Feb  Week 2     184           -0.032
12  Bob   Feb  Week 3     268           -0.053
13  Amy   Feb  Week 3     177           -0.068
14  Bob   Feb  Week 4     268           -0.053
15  Amy   Feb  Week 4     173           -0.089
16  Bob   Mar  Week 1     268            0.000
17  Amy   Mar  Week 1     173            0.000
18  Bob   Mar  Week 2     271            0.011
19  Amy   Mar  Week 2     173            0.000
20  Bob   Mar  Week 3     265           -0.011
21  Amy   Mar  Week 3     170           -0.017
22  Bob   Mar  Week 4     261           -0.026
23  Amy   Mar  Week 4     170           -0.017
24  Bob   Apr  Week 1     261            0.000
25  Amy   Apr  Week 1     170            0.000
26  Bob   Apr  Week 2     258           -0.011
27  Amy   Apr  Week 2     164           -0.035
28  Bob   Apr  Week 3     253           -0.031
29  Amy   Apr  Week 3     164           -0.035
30  Bob   Apr  Week 4     250           -0.042
31  Amy   Apr  Week 4     161           -0.053

In [101]:
week4 = weight_loss.query('Week=="Week 4"')

In [102]:
winner = week4.pivot(index='Month', columns='Name', values='per_weight_loss')

In [103]:
winner

Name     Amy    Bob
Month
Apr   -0.053 -0.042
Feb   -0.089 -0.053
Jan   -0.036 -0.027
Mar   -0.017 -0.026

In [104]:
import numpy as np

In [105]:
winner['Winner'] = np.where(winner['Amy'] <winner['Bob'],'Amy', 'Bob')

In [106]:
winner

Name     Amy    Bob Winner
Month
Apr   -0.053 -0.042    Amy
Feb   -0.089 -0.053    Amy
Jan   -0.036 -0.027    Amy
Mar   -0.017 -0.026    Bob

In [107]:
winner.Winner.value_counts()

Amy    3
Bob    1
Name: Winner, dtype: int64